# MomentOfInertiaWeakAxis Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionAnalysisParams..::..MomentOfInertiaWeakAxis Property
StructuralSectionAnalysisParams Class See Also
---
Moment of Inertia about main weak axis (I).
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double MomentOfInertiaWeakAxis { get; set; }
```

Visual Basic
---
```text
Public Property MomentOfInertiaWeakAxis As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double MomentOfInertiaWeakAxis {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionAnalysisParams Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace